In [1]:
#loading required module
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#loading dataset
data=pd.read_csv("agora.csv")
df=data.copy()

In [3]:
df.head()#display 5 rows

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.describe()#display the statistic value

       Marketing Spend  Administration      Transport         Profit
count        50.000000       50.000000      49.000000      50.000000
mean      73721.615600   121344.639600  215331.732449  112012.639200
std       45902.256482    28017.802755  119665.391550   40306.180338
min           0.000000    51283.140000       0.000000   14681.400000
25%       39936.370000   103730.875000  134050.070000   90138.902500
50%       73051.080000   122699.795000  214634.810000  107978.190000
75%      101602.800000   144842.180000  299737.290000  139765.977500
max      165349.200000   182645.560000  471784.100000  192261.830000

In [5]:
df.shape#show the number of rows and columns

(50, 5)

In [6]:
df.isnull().sum() # find the null values

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [7]:
mean_transport=df.Transport.mean()#calculate the mean value of Transport

In [8]:
df=df.fillna(mean_transport)#remove the NA value

In [9]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Separate Dependent(y) and Independent(x) variable

In [10]:
x=df.drop(['Area','Profit'],axis=1)#drop multiple variable like Area and profit
y=df[['Area','Profit']]

In [11]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [12]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Feature Scaling on dataset

# Normalization/MinMax Scaling

In [13]:
from sklearn.preprocessing import MinMaxScaler
model=MinMaxScaler()

In [14]:
df_minmax=df.copy()

### Fitting and Transforming on single column data

In [15]:
#fitting and Transforming for Marketing Spend
model.fit(df_minmax[['Marketing Spend']])#fitting the single data
df_minmax['Marketing Spend']=model.transform(df_minmax[['Marketing Spend']])#transforming the single data

#fitting and Transforming for Administration
model.fit(df_minmax[['Administration']])#fitting the single data
df_minmax['Administration']=model.transform(df_minmax[['Administration']])#transforming the single data

#fitting and Transforming for Transport
model.fit(df_minmax[['Transport']])#fitting the single data
df_minmax['Transport']=model.transform(df_minmax[['Transport']])#transforming the single data

In [16]:
df_minmax.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

### Fitting and Transforming on multiple columns data

In [17]:
new_x=model.fit_transform(x)#fitting and transforming for multiple column

In [18]:
new_df=pd.DataFrame(new_x,columns=['Marketing Spend','Administration','Transport'])#convert numpy array to DataFrame

In [19]:
new_df.head() #display 5 rows of

   Marketing Spend  Administration  Transport
0         0.692617        0.651744   1.000000
1         0.983359        0.761972   0.940893
2         0.927985        0.379579   0.864664
3         0.873136        0.512998   0.812235
4         0.859438        0.305328   0.776136

In [20]:
type(new_df)

pandas.core.frame.DataFrame

In [21]:
type(y)

pandas.core.frame.DataFrame

In [22]:
new_df.shape

(50, 3)

In [23]:
y.shape

(50, 2)

# I don't understand what is the problem? please clearify it if possible

In [25]:
df_merge=pd.concat(df[new_df,y],axis=1)#I don't understand what is the problem? please clearify it if possible

TypeError: '(    Marketing Spend  Administration  Transport
0          0.692617        0.651744   1.000000
1          0.983359        0.761972   0.940893
2          0.927985        0.379579   0.864664
3          0.873136        0.512998   0.812235
4          0.859438        0.305328   0.776136
5          0.797566        0.369448   0.769126
6          0.814128        0.730161   0.270710
7          0.788018        0.717457   0.686493
8          0.729018        0.741733   0.660500
9          0.745906        0.436929   0.646443
10         0.616351        0.451506   0.485733
11         0.608845        0.308364   0.529362
12         0.567670        0.578836   0.529563
13         0.556352        0.641066   0.535552
14         0.725394        0.801327   0.543708
15         1.000000        0.543030   0.554864
16         0.471808        0.535270   0.560312
17         0.572468        0.714013   0.598948
18         0.554881        0.478772   0.625116
19         0.522650        0.778236   0.456420
20         0.461169        0.476424   0.633053
21         0.474084        0.780210   0.635327
22         0.447505        0.544293   0.642920
23         0.408424        0.414638   0.645992
24         0.465947        0.365388   0.297964
25         0.391080        0.671958   0.292427
26         0.455574        0.706845   0.284134
27         0.436093        0.582978   0.748613
28         0.399467        1.000000   0.250429
29         0.396769        0.774566   0.227092
30         0.374931        0.489928   0.193163
31         0.369741        0.772053   0.186989
32         0.383485        0.593294   0.097683
33         0.335617        0.394134   0.454943
34         0.280776        0.810055   0.446810
35         0.278284        0.257032   0.435618
36         0.173353        0.576825   0.426311
37         0.266527        0.000000   0.417626
38         0.122345        0.111636   0.392690
39         0.233194        0.241309   0.370931
40         0.173901        0.512041   0.366260
41         0.168691        0.254469   0.348614
42         0.142976        0.341852   0.313705
43         0.093776        0.579307   0.075319
44         0.134127        0.788072   0.060059
45         0.006049        0.554724   0.004036
46         0.007956        0.491260   0.629768
47         0.000000        0.640547   0.000000
48         0.003278        0.003502   0.000000
49         0.000000        0.500148   0.095749,        Area     Profit
0     Dhaka  192261.83
1       Ctg  191792.06
2   Rangpur  191050.39
3     Dhaka  182901.99
4   Rangpur  166187.94
5     Dhaka  156991.12
6       Ctg  156122.51
7   Rangpur  155752.60
8     Dhaka  152211.77
9       Ctg  149759.96
10  Rangpur  146121.95
11      Ctg  144259.40
12  Rangpur  141585.52
13      Ctg  134307.35
14  Rangpur  132602.65
15    Dhaka  129917.04
16      Ctg  126992.93
17    Dhaka  125370.37
18  Rangpur  124266.90
19    Dhaka  122776.86
20      Ctg  118474.03
21    Dhaka  111313.02
22  Rangpur  110352.25
23  Rangpur  108733.99
24    Dhaka  108552.04
25      Ctg  107404.34
26  Rangpur  105733.54
27    Dhaka  105008.31
28  Rangpur  103282.38
29    Dhaka  101004.64
30  Rangpur   99937.59
31    Dhaka   97483.56
32      Ctg   97427.84
33  Rangpur   96778.92
34      Ctg   96712.80
35    Dhaka   96479.51
36  Rangpur   90708.19
37      Ctg   89949.14
38    Dhaka   81229.06
39      Ctg   81005.76
40      Ctg   78239.91
41  Rangpur   77798.83
42      Ctg   71498.49
43    Dhaka   69758.98
44      Ctg   65200.33
45    Dhaka   64926.08
46  Rangpur   49490.75
47      Ctg   42559.73
48    Dhaka   35673.41
49      Ctg   14681.40)' is an invalid key

# Standardization Scaling

In [26]:
df_std=df.copy()

In [28]:
df_std.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [29]:
from sklearn.preprocessing import StandardScaler
model_std=StandardScaler()

### Fitting and Transforming on single column data

In [30]:
#fitting and Transforming for Marketing Spend
model_std.fit(df_std[['Marketing Spend']])#fitting the single data
df_std['Marketing Spend']=model_std.transform(df_std[['Marketing Spend']])#transforming the single data

#fitting and Transforming for Administration
model_std.fit(df_std[['Administration']])#fitting the single data
df_std['Administration']=model_std.transform(df_std[['Administration']])#transforming the single data

#fitting and Transforming for Transport
model_std.fit(df_std[['Transport']])#fitting the single data
df_std['Transport']=model_std.transform(df_std[['Transport']])#transforming the single data

In [31]:
df_std.head()#scaling range is not fixed between 0 and 1

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.187271    Dhaka  192261.83
1         1.955860        1.082807   1.949436      Ctg  191792.06
2         1.754364       -0.728257   1.642701  Rangpur  191050.39
3         1.554784       -0.096365   1.431738    Dhaka  182901.99
4         1.504937       -1.079919   1.286479  Rangpur  166187.94

In [32]:
df_std['Transport'].max()

2.187270673704516

### Fitting and Transforming on multiple columns data

In [33]:
new_std_x=model_std.fit_transform(x)#fitting and transforming for multiple column

In [34]:
df_std_multiple=pd.DataFrame(new_std_x,columns=['Marketing Spend','Administration','Transport'])#convert numpy array to DataFrame

In [35]:
df_std_multiple.head()

   Marketing Spend  Administration  Transport
0         0.897913        0.560753   2.187271
1         1.955860        1.082807   1.949436
2         1.754364       -0.728257   1.642701
3         1.554784       -0.096365   1.431738
4         1.504937       -1.079919   1.286479

# Robust Scaler Scaling

In [36]:
df_robust=df.copy()

In [37]:
from sklearn.preprocessing import RobustScaler
model_robust=RobustScaler()

### Fitting and Transforming on single column data

In [38]:
#fitting and Transforming for Marketing Spend
model_robust.fit(df_robust[['Marketing Spend']])#fitting the single data
df_robust['Marketing Spend']=model_robust.transform(df_robust[['Marketing Spend']])#transforming the single data

#fitting and Transforming for Administration
model_robust.fit(df_robust[['Administration']])#fitting the single data
df_robust['Administration']=model_robust.transform(df_robust[['Administration']])#transforming the single data

#fitting and Transforming for Transport
model_robust.fit(df_robust[['Transport']])#fitting the single data
df_robust['Transport']=model_robust.transform(df_robust[['Transport']])#transforming the single data

In [39]:
df_robust.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.561661    Dhaka  192261.83
1         1.452113        0.697565   1.392082      Ctg  191792.06
2         1.303634       -0.524290   1.173378  Rangpur  191050.39
3         1.156567       -0.097977   1.022959    Dhaka  182901.99
4         1.119836       -0.761543   0.919389  Rangpur  166187.94

### Fitting and Transforming on multiple columns data

In [40]:
new_robust_x=model_robust.fit_transform(x)#fitting and transforming for multiple column

In [41]:
new_df_robust=pd.DataFrame(new_robust_x,columns=['Marketing Spend','Administration','Transport'])#convert numpy array to DataFrame

In [42]:
new_df_robust.head()

   Marketing Spend  Administration  Transport
0         0.672530        0.345355   1.561661
1         1.452113        0.697565   1.392082
2         1.303634       -0.524290   1.173378
3         1.156567       -0.097977   1.022959
4         1.119836       -0.761543   0.919389

# Max Absolute Scaler

In [43]:
df_maxabs=df.copy()

In [44]:
df_maxabs.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [45]:
from sklearn.preprocessing import MaxAbsScaler
model_maxabs=MaxAbsScaler()

### Fitting and Transforming on single column data

In [46]:
#fitting and Transforming for Marketing Spend
model_maxabs.fit(df_maxabs[['Marketing Spend']])#fitting the single data
df_maxabs['Marketing Spend']=model_maxabs.transform(df_maxabs[['Marketing Spend']])#transforming the single data

#fitting and Transforming for Administration
model_maxabs.fit(df_maxabs[['Administration']])#fitting the single data
df_maxabs['Administration']=model_maxabs.transform(df_maxabs[['Administration']])#transforming the single data

#fitting and Transforming for Transport
model_maxabs.fit(df_maxabs[['Transport']])#fitting the single data
df_maxabs['Transport']=model_maxabs.transform(df_maxabs[['Transport']])#transforming the single data

In [47]:
df_maxabs.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

### Fitting and Transforming on multiple columns data

In [48]:
new_maxabs_x=model_maxabs.fit_transform(x)#fitting and transforming for multiple column

In [49]:
new_df_maxabs=pd.DataFrame(new_robust_x,columns=['Marketing Spend','Administration','Transport'])#convert numpy array to DataFrame

In [50]:
new_df_maxabs.head()

   Marketing Spend  Administration  Transport
0         0.672530        0.345355   1.561661
1         1.452113        0.697565   1.392082
2         1.303634       -0.524290   1.173378
3         1.156567       -0.097977   1.022959
4         1.119836       -0.761543   0.919389